
 // Процедура осуществляет печать документа. Можно направить печать на 
// экран или принтер, а также распечатать необходмое количество копий.
//
//  Название макета печати передается в качестве параметра,
// по переданному названию находим имя макета в соответствии.
//
// Параметры:
//  НазваниеМакета - строка, название макета.
//
Функция Печать() Экспорт
	
	ТабДокумент = Новый ТабличныйДокумент;
	ТабДокумент.АвтоМасштаб	= Истина;
	ТабДокумент.ОриентацияСтраницы = ОриентацияСтраницы.Ландшафт;
    ТабДокумент.ЭкземпляровНаСтранице = 1;
	 
	 ТабДокумент.ПолеСверху = 0;
	 ТабДокумент.ПолеСлева 	= 0;
	 ТабДокумент.ПолеСнизу 	= 0;
	 ТабДокумент.ПолеСправа = 0;

	                        
	Макет = ПолучитьМакет("ПФ_MXL_4П");
	
	ОблЛицевая = Макет.ПолучитьОбласть("Лицевая");
	ОблОборотная = Макет.ПолучитьОбласть("Оборотная");
		
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ПутевойЛистСКОП.Организация,
		|	ПутевойЛистСКОП.Водитель,
		|	ПутевойЛистСКОП.Номер,
		|	ПутевойЛистСКОП.Организация.КодПоОКПО КАК КодПоОКПО,
		|	ПутевойЛистСКОП.Дата,
		|	ПутевойЛистСКОП.ОС КАК Авто,
		|	ПутевойЛистСКОП.Организация.НаименованиеСокращенное КАК НаименованиеСокращенное,
		|	ПутевойЛистСКОП.СпидометрН,
		|	ПутевойЛистСКОП.СпидометрК,
		|	ПутевойЛистСКОП.ПолученноБензина,
		|	ПутевойЛистСКОП.ОстатокНачальный,
		|	ПутевойЛистСКОП.ОстатокКонечный
		|ИЗ
		|	Документ.ПутевойЛистСКОП КАК ПутевойЛистСКОП
		|ГДЕ
		|	ПутевойЛистСКОП.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", СсылкаНаОбъект);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Выборка.Следующий();
	
	ОблЛицевая.Параметры.Организация = Выборка.НаименованиеСокращенное;
	ОблЛицевая.Параметры.Номер = Сред(СокрЛП(Выборка.Номер),3);
	ОблЛицевая.Параметры.Водитель1 = Выборка.Водитель;
	ОблЛицевая.Параметры.КодПоОКПО = Выборка.КодПоОКПО;
	ОблЛицевая.Параметры.ДатаВыписки = Формат(Выборка.Дата,"ДЛФ=DD");
	ОблЛицевая.Параметры.МодельТС = Выборка.Авто;
	ОблЛицевая.Параметры.СпидометрВыезда =  Выборка.СпидометрН;
	ОблЛицевая.Параметры.СпидометрВозврата = Выборка.СпидометрК;
	ОблЛицевая.Параметры.ВыданоГСМ1 = Выборка.ПолученноБензина;
	ОблЛицевая.Параметры.ОстатокПриВыезде1 = Выборка.ОстатокНачальный;
	ОблЛицевая.Параметры.ОстатокПриВозвращении1 = Выборка.ОстатокКонечный;
	
		
	
	ТабДокумент.Вывести(ОблЛицевая);
	ТабДокумент.Вывести(ОблОборотная);
	
		
	Возврат ТабДокумент;
КонецФункции // Печать

